Product/trunk/DDPs/NetworkResourceBasic/IIS/xml/notify-ResourceAttributeValueChangeTest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xsi:schemaLocation="http://www.tmforum.org/mtop/nrb/xsd/rscavc/v1 ../xsd/EventResourceAttributeValueChange.xsd http://www.tmforum.org/mtop/nrf/xsd/me/v1 ../../../NetworkResourceFulfillment/IIS/xsd/Me.xsd http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../../../Framework/IIS/xsd/NotificationMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>NOTIFICATION</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>RPC</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <m0:resourceAttributeValueChange xmlns:m0="http://www.tmforum.org/mtop/nrb/xsd/rscavc/v1" xmlns:m1="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:m2="http://www.tmforum.org/mtop/fmw/xsd/ei/v1" xmlns:m3="http://www.tmforum.org/mtop/fmw/xsd/avc/v1">
          <m1:notificationId>String</m1:notificationId>
          <m1:sourceTime>2001-12-17T09:30:47.0Z</m1:sourceTime>
          <m1:vendorExtensions/>
          <m2:objectName>
            <nam:object>
              <nam:type>MD</nam:type>
              <nam:name>Company/String</nam:name>
            </nam:object>
            <nam:object>
              <nam:type>ME</nam:type>
              <nam:name>String</nam:name>
            </nam:object>
          </m2:objectName>
          <m2:osTime>2001-12-17T09:30:47.0Z</m2:osTime>
          <!-- original (MTOSI 1.x) attribute was attributeList based on AnyListType -->
          <m3:attributeList>
            <!-- all elements have to be associated with a namespace -
                  problem which namespace to use for all various data types supported by AVC?
                  Two solutions:
                  1. Use the object global element and populate only the relevent attributes (all are optionals)
                      See examples below with deleted and set lists (preferred method)
                  2. Use NvsList for attributes based on simpleType.
                      Use a global element for each supported attribute data type based complexType.
                      Need to define them for some data types like aliasNameListType, layeredParametersListType, etc
 -->
            <nam:nvsList>
              <nam:nvs>
                <nam:name>userLabel</nam:name>
                <nam:value>new_value</nam:value>
              </nam:nvs>
              <nam:nvs>
                <nam:name>softwareVersion</nam:name>
                <nam:value>new_value</nam:value>
              </nam:nvs>
            </nam:nvsList>
            <!-- this fails as yet not defined as global element  -->
            <aliasNameList>
              <gen:alias>
                <gen:aliasName>meLabel</gen:aliasName>
                <gen:aliasValue/>
              </gen:alias>
            </aliasNameList>
            <!-- this fails as yet not defined as global element transmissionParams of type LayeredParametersListType  -->
            <transmissionParams>
              <lp:layeredParameters>
                <lp:layer extension="myLayerRate">VENDOR_EXT</lp:layer>
                <lp:transmissionParams>
                  <nam:nvs>
                    <nam:name>String</nam:name>
                    <nam:value/>
                  </nam:nvs>
                </lp:transmissionParams>
                <lp:vendorExtensions/>
              </lp:layeredParameters>
            </transmissionParams>
          </m3:attributeList>
          <m3:deletedAttributeList>
            <me:me xmlns:coi="http://www.tmforum.org/mtop/fmw/xsd/coi/v1" xmlns:me="http://www.tmforum.org/mtop/nrf/xsd/me/v1">
              <!-- an alias (meLabel) and vendor extension (att1 & att2) are deleted -->
              <coi:aliasNameList>
                <gen:alias>
                  <gen:aliasName>meLabel</gen:aliasName>
                  <gen:aliasValue/>
                </gen:alias>
              </coi:aliasNameList>
              <coi:vendorExtensions>
                <nt:example xmlns:nt="www.example.com/mtosi/xsd/me">
                  <nt:att1/>
                  <nt:att2/>
                </nt:example>
              </coi:vendorExtensions>
            </me:me>
          </m3:deletedAttributeList>
          <m3:setAttributeList>
            <me:me xmlns:coi="http://www.tmforum.org/mtop/fmw/xsd/coi/v1" xmlns:me="http://www.tmforum.org/mtop/nrf/xsd/me/v1">
              <!-- userLabel and owner are set -->
              <coi:userLabel>String</coi:userLabel>
              <coi:owner>String</coi:owner>
            </me:me>
          </m3:setAttributeList>
          <m0:edgePointRelated>false</m0:edgePointRelated>
        </m0:resourceAttributeValueChange>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
