mtosi_2.0/main/DDPs/Framework/IIS/xml/notify-odis.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:odis="http://www.tmforum.org/mtop/fmw/xsd/odis/v1" xmlns:cei="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xsi:schemaLocation="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1 ../xsd/HeaderDefinitions.xsd http://www.tmforum.org/mtop/fmw/xsd/odis/v1 ../xsd/EventObjectDiscovery.xsd http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../xsd/NotificationMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>REQUEST</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>MSG</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <odis:objectDiscovery>
          <cei:notificationId>String</cei:notificationId>
          <cei:osTime>2001-12-17T09:30:47.0Z</cei:osTime>
          <cei:vendorExtensions/>
          <odis:discoveredName>Company/String</odis:discoveredName>
          <odis:objectType>ME</odis:objectType>
          <odis:neTime>2001-12-17T09:30:47.0Z</odis:neTime>
          <odis:edgePointRelated>false</odis:edgePointRelated>
        </odis:objectDiscovery>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
